[{"photo":"cerna","slug":"greg-cerna","name":"Greg Cerna","hed":"'Seeing the image of me facedown in my own blood was surreal, terrifying'","author":"Eric Dexheimer","captions":{"now":"Greg Cerna, injured in last year’s crash at SXSW, says he continues to struggle with his memory a year after the incident.","then":"Greg Cerna lies motionless and bleeding moments after a drunken driver plowed through a crowd outside the Mohawk on Red River Street during South by Southwest around 12:30 a.m. Thursday, March 13, 2014."},"video":"jTX0xlB8pWE","vignette":"<p>Greg Cerna had just grabbed a bite to eat at Heavy Metal Pizza and was walking with friends toward the Tyler, the Creator concert when the car driven by Rashad Owens slammed into him.</p>\n<p>And that’s where his memory of the night dissolves. “I remember very vague things — like sirens and loud noises and people yelling and screaming,” he said. “And waking up in the hospital on a lot of pain killers.”</p>\n<p>Cerna was literally knocked out of his shoes. In photos, he is lying on the ground with people clustered around him.</p>\n<p>“Seeing the image of me facedown in my own blood was surreal, terrifying,” he said. “It didn’t seem like that could’ve actually happened.”</p>\n<p>Cerna’s visible physical injuries — a gash to the head, cuts and bruises on the length of his body — healed quickly. The weekend after the accident, the University of Texas sophomore announced he was returning to his engineering classes on Monday. But it soon became apparent that his wounds were deeper than he’d thought.</p>\n<p>“I had no idea what I was asking myself to do,” he said. “I tried going back, but then I realized I couldn’t concentrate, I couldn’t focus, I couldn’t remember what (professors) were talking about.”</p>\n<p>He ended up dropping a class. The following fall was a challenge, too: “I really overwhelmed myself, and it didn’t go well.” This spring, he decided to cut back his course load to only nine hours, a relief.</p>\n<p>He continues to struggle with his memory. The incident still informs his behavior in unexpected ways. “When I cross the street at night, and even if a car is far away but it’s still coming, I have a sense of dread that washes over me,” he said.</p>\n<p>And he says the crash occupies uncertain mental terrain. He’s ready to move on — “Tragic-accident famous is not all that it cracked up to be” — yet he’s also still drawn to things related to the events of that night, such as his 2014 badge, which he has kept.</p>\n<p>“It’s in a box. It’s still bloody. I still have my hospital wristband as well,” he said. “I need a reminder that it wasn’t some kind of fever dream — that it happened, and that’s my blood on the badge.”</p>\n"},{"photo":"cohen","slug":"jessica-cohen","name":"Jessica Cohen","author":"Ciara O'Rourke","captions":{"now":"Jessica Cohen, a medic with 20 years of experience, has shrugged off praise for joining first responders at the crash scene: “I just happened to be in the right place at the right time.”","then":"Jessica Cohen, third from left, carries an injured man to an ambulance after the 2014 crash."},"vignette":"<p>Jessica Cohen was working in the sound booth during a show at Elysium when someone ran inside and announced that there had been a crash.</p>\n<p>Cohen, a medic with 20 years of experience, grabbed her jacket and went to help. She was no stranger to mass casualty events, and she said could tell right away who was at risk of dying. She knew what had to be done.</p>\n<p>But she has shrugged off praise for joining the first responders outside.</p>\n<p>“I just happened to be in the right place at the right time,” she said.</p>\n"},{"photo":"gandy","slug":"kelle-gandy","name":"Kelle Gandy","hed":"'I was like, \"Is this real? Is this a horror film?\"'","author":"Jeremy Schwartz","captions":{"now":"Kelle Gandy says she remembers the acts of kindness among the strangers on Red River Street after the crash. “Everybody started coming around telling you everything’s OK.”","then":"Kelle Gandy, second from left with hands in face, covers her face moments after a drunk driver plowed through a crowd outside the Mohawk."},"video":"BpcNbqO7X68","vignette":"<p>Kelle Gandy had been waiting all day to see Tyler, the Creator at the Mohawk. But when the Houston resident and her friends arrived at the club, the line was so long they spilled onto Red River Street, which had been blocked off for pedestrians.</p>\n<p>Shortly after midnight, a security guard shooed Gandy and her friends onto the sidewalk.</p>\n<p>Seconds later, she saw the bright lights of a car coming toward her. And then she heard the car hitting people in the street. “It just sounded like pounding,” she remembers. “He was going fast enough to hit multiple people and not give people time to get out of the street. It just sounded like thumping over and over and over.”</p>\n<p>She watched the car fly through an intersection, where it slammed into a small motorcycle and kept going.</p>\n<p>“I was like, ‘Is this real? Is this a horror film?’ ” she said.</p>\n<p>Two of her friends were injured: Ashley Easley, whom she had just met that night, was unconscious in the arms of another friend.</p>\n<p>“I remember saying ‘I want to help,’ but what I felt I had was not enough to save the people who were really hurt.” She sat on the ground and prayed.</p>\n<p>In the chaos that unfolded, she remembers acts of kindness among the strangers on Red River Street. “Everybody started coming around telling you everything’s OK,” she said. “Everybody was trying to help each other not to worry so much.”</p>\n<p>After giving a statement to police, Gandy and the remaining group rode to the hospital to visit their injured friends. “We were just dead silent the whole car ride,” she said. “You can’t even believe what happened.”</p>\n<p>That silence would carry over into the next year among Gandy and her friends. “We don’t really talk about it that much,” she said. “I don’t think anybody understands how traumatic it can be in that situation. When you are watching those people pass away and there’s nothing you can do, it kind of leaves you at a point where you don’t want to talk.”</p>\n<p>But the incident also strengthened the bond between them. After enrolling in Texas State University last fall, Gandy grew close to San Marcos resident Easley, whom she had met on the day of the crash. “We still don’t talk about it, but it feels like she knows I was there,” she said. “It’s hard to explain, but you just have a connection because you were there through something that’s really hard.</p>\n<p>“And that’s what friends are for, to be there through good times and the bad.”</p>\n"},{"photo":"george","slug":"maggie-george","name":"Maggie George","hed":"'All I could do was just hold her hand and hope'","captions":{"now":"Maggie George and her fiancé, Deven Penn, assisted victim Sandy Le the night of the crash. When Le’s family decided to remove her from life support two days later, they invited the couple back to the hospital to be with them when the 26-year-old passed away.","then":"Deven Penn, at middle in a gray jacket, does chest compressions on Sandy Le following the crash. Penn's fiancée, Maggie George, standing at far right in a black jacket, watches the efforts."},"author":"Eric Dexheimer","vignette":"<p>To 25-year-old Maggie George, the mayhem in front of her that night at first seemed unreal. “I didn’t really realize what had happened,” she said. “It looked like a cartoon.”</p>\n<p>But it quickly became evident that she had just witnessed a real-life tragedy unfold before her eyes — “People were dying and screaming.”</p>\n<p>It had been barely a year since George, a native of western New York, had adopted Texas as her home in the middle of a cross-country road trip from Buffalo to California. The hairstylist was with her boyfriend, Deven Penn.</p>\n<p>Seeing a young woman lying on the pavement only minutes after police say Rashad Owens careened through the crowd, Penn had run out into the street to help. In a photograph, he can be seen performing CPR while George looks anxiously over his left shoulder. “She looked pretty bad, so all I could do was just hold her hand and hope,” she recalled.</p>\n<p>George said the intensity of what she’d just witnessed didn’t really hit her until the next day, when somebody had idly asked her if she’d heard about the crash. “I broke down in tears,” she said.</p>\n<p>Seeking news of the nameless woman they’d rushed to help, the couple called several hospitals, asking if any had an Asian woman in critical condition. University Medical Center Brackenridge did, and the two found themselves driving over.</p>\n<p>The woman turned out to be a 26-year-old Vietnamese woman, Sandy Le. Her family had arrived from Mississippi, and they embraced George and Penn as a tangible link to her final conscious moments. While Le’s relatives didn’t speak much English, George said they quickly established an intense bond, hugging frequently.</p>\n<p>Le’s injuries were unsurvivable, though George said Penn’s CPR had helped keep her body alive long enough for her to be an organ donor. Two days later, when Le’s family decided to remove her from life support, George said they invited the couple back to the hospital room to be with them when Le passed away.</p>\n<p>“They really seemed to like having us there,” she recalled.</p>\n"},{"photo":"ibemere","slug":"gideon-ibemere","name":"Gideon Ibemere","hed":"'Then I realized those people aren't alive'","author":"Ciara O'Rourke","captions":{"now":"Gideon Ibemere, 22, jumped out of the way and narrowly missed being injured in the crash. He says sirens startle him and that he still approaches crosswalks timidly.","then":"Gideon Ibemere, right, comforts an injured man moments after the crash. Jaime Wilken, left, and another person try to comfort an injured April Martinez, middle."},"vignette":"<p>Gideon Ibemere was walking toward the line winding away from the Mohawk when he heard tires screech behind him — then a boom.</p>\n<p>A car barreled through a traffic barricade and slammed into the man he had been talking to moments earlier. Ibemere had jumped out of the way and watched as the driver swung to the other side of the street. The engine revved, but the scene seemed to unfold in slow motion. The street was covered in blood.</p>\n<p>People wailed as Ibemere ran back to Cheer Up Charlie&#39;s, where he had been volunteering that night, and grabbed water bottles to hand out to the wounded. He used his flannel shirt to cover a man who couldn’t move his leg and was asking why it hurt. He wondered why the police weren’t helping two other people who were lying in the middle of the street.</p>\n<p>“Then I realized those people aren’t alive,” he said. “They aren’t there anymore. Those people aren’t there.”</p>\n<p>For weeks the memory haunted him, shaking him awake 30 minutes after he finally fell asleep. He stopped drinking alcohol for a while. He struggled crossing the street and riding in cars.</p>\n<p>Back in Sherman, where Ibemere attends Austin College, he still approaches crosswalks timidly. Sirens startle him. The first time he heard one after the crash, he stopped and put his hands over his ears and cried.</p>\n<p>He started thinking about the crash more as the festival neared, but remembering what happened doesn’t pain him like it used to. His spring break falls before the South by Southwest Music Conference and Festival this year, but if he can ever volunteer for it again, he said, he probably will.</p>\n"},{"photo":"kittok","slug":"mike-kittok","name":"Mike Kittok","hed":"'I saw a lot of bystanders just running and screaming and crying'","author":"Eric Dexheimer","captions":{"now":"Austin-Travis County EMS paramedic Mike Kittok, a first responder at the crash, said the response was “really well-run” because medical officers had held additional training prior to SXSW.","then":"Austin-Travis County EMS paramedic Mike Kittok, in white shirt, gets ready to transport crash victim Sandy Le to a hospital."},"vignette":"<p>The first call paramedic Mike Kittok received was of an auto-pedestrian collision downtown. Moments later, as he and his partner raced east from Station 17, by Deep Eddy, the call was upgraded to a mass casualty incident, an event in which the number of injured outstripped the immediately available resources.</p>\n<p>Kittok’s was the third ambulance on scene. As his partner turned the truck around and backed in to the area near 10th and Red River streets to better load patients, Kittok checked in with the command center for an assignment.</p>\n<p>The fact that there was already a command center in place was unusual. Typically, a medical crew arriving as quickly as Kittok’s would be performing triage, the process of dividing patients into treatment priority groups by the severity of their injuries.</p>\n<p>But in addition to all the first responders assigned to patrol the festival already on scene, in the week prior to South by Southwest medical officers had held what’s known as a tabletop training, in which they reviewed how they would handle an incident in which a car plowed into attendees. “So it was really well-run,” Kittok said.</p>\n<p>A 10-year veteran of the job, Kittok had been on mass casualty scenes before, such as multicar pileups and the 2013 Onion Creek floods. The SXSW crash was crowded: “I saw a lot of bystanders just running and screaming and crying. I saw lots of groups of people around different victims on the ground.”</p>\n<p>Kittok was initially assigned to care for a woman with a leg injury, but he was pulled off that patient when Sandy Le, who had received CPR from festival attendee Deven Penn, regained a pulse and needed immediate transport to the hospital. Kittok started an IV in her leg, strapped her to a backboard and took off for University Medical Center Brackenridge.</p>\n<p>He estimated he was on the scene for about 7 minutes. EMS officials say the more than two dozen injured were completely cleared in less than 45 minutes — an extraordinary accomplishment.</p>\n<p>To a paramedic, bystanders can be an obstacle to rapid care, or a huge help. Kittok said the SXSW attendees were overwhelmingly an asset.</p>\n<p>“It seemed like the majority of the people helping on this were doing a really good job,” he said. Some were keeping victims still to prevent aggravating a possible spinal injury; another had used a tourniquet to stop bleeding on a patient’s leg.</p>\n"},{"photo":"martinez","slug":"april-martinez","name":"April Martinez","hed":"'You just never know what will happen'","author":"Andrea Ball","captions":{"now":"April Martinez had eight screws and four plates put in her ankle after being hurt in the crash. Her boyfriend suffered a head injury, and a friend later died from injuries sustained in the wreck.","then":"April Martinez, middle, and others are stunned moments after a drunk driver plowed through a crowd outside the Mohawk."},"vignette":"<p>Some things from March 13, 2014, are seared into April Martinez’s memory.</p>\n<p>The sound of a car engine. The headlights. The sensation of something hard hitting her leg, a stranger carrying her to the sidewalk, the sight of her boyfriend lying unconscious on the street and the mass frenzy that followed.</p>\n<p>One year later, she still can’t believe it happened.</p>\n<p>“It’s pretty much one of the most traumatic things that ever happened to me,” she said.</p>\n<p>Martinez, her boyfriend, Tyler McCraney, and some friends were wrapping up for the night just before the crash. They’d been to the Yellow Jacket Social Club and Beerland. They’d just been to Hoboken Pie for pizza, and the group was headed to McCraney’s tan Honda Accord. Their friend Sandy Le was with them.</p>\n<p>The sidewalk was packed so they walked in the street. Martinez was texting photos of the night to one of her friends when she heard a car engine. She saw headlights and tried to jump out of the way, but the car caught her ankle. She looked up and saw the vehicle driving away.</p>\n<p>Martinez couldn’t get to McCraney, but someone told her he was alive. She was rushed to St. David’s South Austin Medical Center, where doctors put eight screws and four plates in her ankle. She sat by McCraney’s side as he struggled with a head injury. And she was devastated when Sandy Le later died from injuries sustained in the wreck.</p>\n<p>The accident changed the way Martinez sees life.</p>\n<p>“You appreciate more and cherish the time you have with your friends, because you just never know what will happen,” she said.</p>\n"},{"photo":"leuro","slug":"jc-leuro","name":"JC Leuro","hed":"'The next thing I know I was on the ground'","author":"Ciara O'Rourke","video":"qmO_wgZ2mxM","captions":{"now":"JC Leuro, injured in the crash, says questions have lingered about what he could have done differently that night.","then":"JC Leuro, left, and others are stunned moments after a drunken driver plowed through a crowd on Red River Street."},"vignette":"<p>JC Leuro had been waiting with his friends to see Tyler, the Creator when they decided to bail. The line they had been standing in was long and chaotic, and Leuro urged them to leave.</p>\n<p>As they walked away he heard a car accelerate behind him.</p>\n<p>“The next thing I know I was on the ground,” he said.</p>\n<p>He didn’t remember getting hit, but he flew several feet in the air, landing on his elbows. When he opened his eyes, he saw the driver of the car speed by with a police officer in pursuit. There were bodies in their wake. Everybody was screaming.</p>\n<p>But it felt like there were three bystanders for every victim. A woman gave Leuro her sweater as he shivered. Two people who weren’t hit helped him stand up and stayed with him until he could get into an ambulance. They were strangers, but they stuck around, he said, “making sure I knew where I was at — knew what was going on.”</p>\n<p>He was released from the hospital around 4:30 a.m. and went home with his arm in a sling, bruises and some road rash. Friends kept calling over the next few days, and he explained what happened dozens of times. He was at a loss.</p>\n<p>Lower back pain that resulted of the crash has lingered, as well as questions about what would have happened if he had rallied his friends to leave a few seconds earlier. Would they have crossed the street in time, or would they have suffered worse injuries or death?</p>\n<p>“For a long time it really bothered me just having to rethink the situation and thinking if I could have done something different,” he said. “Just thinking of those ‘what ifs.’ ”</p>\n<p>Eventually he decided to move on — there was nothing he could do, he said. He became a better student and a better person. After he graduates from the University of Texas in May, he wants to apply to medical school.</p>\n<p>But he still hates Rashad Owens, whom he blames for killing four people and causing many more to suffer.</p>\n<p>Leuro doesn’t want to see him, but police have told him they may ask him to testify.</p>\n<p>“Anything I can do to help put this man in jail,” he said.</p>\n"},{"photo":"mccraney","slug":"tyler-mccraney","name":"Tyler McCraney","hed":"Recovery 'took a big chunk out of that year'","author":"Tony Plohetski","captions":{"now":"Tyler McCraney suffered a fracture on his skull about an inch above his spine and spent four months recovering at his parents’ house in Mississippi before deciding to return to Austin.","then":"A man waves for help as Tyler McCraney lies unconscious on the pavement moments after the crash."},"vignette":"<p>The last memory Tyler McCraney has from that night is eating a slice of pizza at Hoboken Pie at 718 Red River St. and thinking that he needed to head home.</p>\n<p>The Mississippi native, who moved to Austin in the summer of 2011, wanted to make sure he had enough rest at his job as bank teller the next day.</p>\n<p>Within minutes, police say Rashad Owens struck McCraney, who is now 27, as his car careened down the street where McCraney and others were walking.</p>\n<p>“There is a lot I don’t remember, and I don’t remember the accident,” he said. McCraney was with two friends and his girlfriend.</p>\n<p>“We were just going to different places along Red River,” he said. “The only thing I kept thinking was that I didn’t want to be out too late.”</p>\n<p>He suffered a fracture on his skull about an inch above his spine. McCraney spent the next 10 days in the hospital, then returned to his parents’ house in Laurel, Miss., to complete his recovery.</p>\n<p>“It took a big chunk out of that year,” he said.</p>\n<p>McCraney spent the next four months in physical and cognitive therapy before deciding to come back to Austin.</p>\n<p>“I had already started my life here,” he said. “I had already been here 3 1/2 to four years, and so there was really no reason for me not to come back. I had a good job, and my girlfriend lives here.”</p>\n<p>McCraney said he still suffers residual effects from his injuries. He sometimes gets dizzy when he lays down, a condition he said is similar to vertigo. The injury to his brain also damaged his ability to taste and smell.</p>\n<p>“I try to look at the bright side of not being able to smell the things that are unpleasant,” McCraney said, “but I do miss the things that were pleasant.”</p>\n"},{"photo":"penn","slug":"deven-penn","name":"Deven Penn","hed":"'I feel fortunate I was able to help somebody'","author":"Tony Plohetski","video":"yba0shppHZI","captions":{"now":"Deven Penn performed CPR on crash victim Sandy Le, who died of her injuries days later. He and his fiancée had stepped out of the street moments before and narrowly avoided injury themselves.","then":"Deven Penn, at middle in a gray jacket, does chest compressions on Sandy Le following the crash. Penn's fiancée, Maggie George, standing at far right in a black jacket, watches the efforts."},"vignette":"<p>Deven Penn still remembers the horrible sounds and sights from that night: The thud of bodies being struck by a moving car followed by watching them bounce into the air and quickly fall to the ground.</p>\n<p>“Then we just heard screams,” said Penn, a martial arts instructor.</p>\n<p>He had been at South by Southwest for several hours that night with his fiancee, moving through SXSW revelers and Austin’s downtown entertainment district on bicycles.</p>\n<p>Minutes earlier, they had been walking along Red River Street but had stepped up on the curb to unlock their bikes as they started the trip home.</p>\n<p>Penn said they narrowly avoided injury themselves.</p>\n<p>“At first we didn’t know what was going on,” he said. “But then I saw that there were people lying everywhere and unconscious, and we realized that people were really hurt.”</p>\n<p>Penn said he first saw a man, likely in his early 20s, who appeared to be having a seizure. Penn said he tried to stabilize him and talk to him.</p>\n<p>“I was just trying to talk him through it,” he said.</p>\n<p>Then he spotted a woman on the ground who appeared to be critically injured and was “bleeding really heavily all over.” He raced toward her and started giving her CPR.</p>\n<p>Seconds later, he said, police officers and medics showed up and took over.</p>\n<p>A couple of days later, Penn said he wanted to try to find the woman he aided. He and his fiancee went to the hospital with their minister and found her family.</p>\n<p>The woman, Sandy Le, died a couple of days later.</p>\n<p>“I’m glad that I was where I was, and me and my fiancee were lucky enough to have stepped out of the street. We were in his line of path,” Penn said. “I wouldn’t choose to be anywhere else in that time, though. I feel fortunate I was able to help somebody.”</p>\n"},{"photo":"rodriguez","slug":"desiree-rodriguez","name":"Desiree Rodriguez","hed":"'She had to hold on to me because I was just shaking'","author":"Ciara O'Rourke","video":"ZF5yceHIwpU","captions":{"now":"Ashley Easley, left, and Desiree Rodriguez were injured in the crash. Rodriguez cradled her unconscious friend’s head at the scene, worried she had been killed.","then":"Desiree Rodriguez, in white shirt at lower left, comforts her friend Ashley Easley following the crash."},"vignette":"<p>When Desiree Rodriguez and her friends walked away from the line to see Tyler, the Creator, she was starving, and she watched hungrily as a couple passed with a Styrofoam container.</p>\n<p>“They’re so lucky,” she thought. “They’re about to eat.”</p>\n<p>Then someone swore and she turned, facing the headlights of a Honda that charged forward and knocked Rodriguez and her friends to the ground.</p>\n<p>She rolled past one of the car’s mirrors before hitting the cement. As she looked up she saw the vehicle slam into the couple whose meal she had just envied. They flew over the hood.</p>\n<p>When she later found out that one of them, De&#39;Andre Tatum, had died, she said she broke down.</p>\n<p>But in the seconds after the crash, the street littered with glass, she tried to run over to Tatum and his girlfriend, Curtisha Davis. She stopped when she realized that her friend, Ashley Easley, was unconscious. Rodriguez cradled her head, worried she had been killed.</p>\n<p>It’s hard for her to realize they could have been.</p>\n<p>It was her first time at South By Southwest, and the Texas State University student, who wants to be a homicide detective for the Austin Police Department, planned to see Lady Gaga the next day.</p>\n<p>Only then it looked like a war zone, with the tears that followed the screaming audible over music from nearby concerts.</p>\n<p>“I remember just walking up to one woman that worked at South by Southwest and just bawling,” Rodriguez said. “She had to hold on to me because I was just shaking.”</p>\n<p>She couldn’t cross the street for a month and she struggled to drive at night, “because all I see are headlights,” she said at the time.</p>\n<p>She used to dream about the crash, a gruesome scene on repeat as she slept. But sometimes it was worse. Sometimes Easley wouldn’t wake up.</p>\n"},{"photo":"wilken","slug":"jamie-wilken","name":"Jamie Wilken","hed":"'... But my head was somewhere else'","author":"Eric Dexheimer","captions":{"now":"Jaime Wilken, who witnessed the crash, says the scope of the incident came into focus as she walked down the street: “It was another body, another body, another body.”","then":"Jaime Wilken, Gideon Ibemere and JC Leuro are stunned following the crash."},"vignette":"<p>The way Jaime Wilken’s brain registered the chaotic events unfolding in front of her was like a snapshot, a freeze-frame of tragedy lodged in her mind. In that mental image, she sees a silver car with a man in a plaid shirt crumpled in a ball on its hood.</p>\n<p>A recent graduate of Texas State University, Wilken had been working the festival as part of the band load-in crew at Cheer Up Charlies. She was on the sidewalk close to Red River Street when police say Rashad Owens plowed through the late-night crowd. “No one knew what to do,” she said. “Some people began helping out. But others just kept on walking around, going about their business.”</p>\n<p>She gave one girl lying on the ground her coat — “The only thing we could think to do was to keep her warm” — and hugged another stranger standing by an injured man, “Because what else could you do?” She felt a surge of fear, a sense that suddenly no one was safe.</p>\n<p>As she walked down the street, the scope of the incident came into focus. “It was another body, another body, another body,” she said. In a photograph, Wilken can be seen covering her mouth in shock and disbelief. Widely reprinted, it brought her a measure of fame. “I had friends in England contact me, saying, ‘Jaime … you’re on our news!’ ”</p>\n<p>One of the first people she looked for as she wandered through the carnage was a young man she’d just met, Gideon Ibemere, who’d been volunteering at the same bar. The two had spoken for a few minutes before he’d wandered off.</p>\n<p>She remembers Ibemere suddenly appearing next to her, saying over and over, “It hit me, it hit me, it hit me. The car brushed my leg,” though his injuries turned out to be minor. The two stayed in touch over the past year, mostly through texts but also with the occasional visit.</p>\n<p>In the days immediately following the crash, “I was functioning, but my head was somewhere else,” Wilken recalled. She struggled to process how rapidly people seemed to normalize what for her had been such an intense, life-altering event. “You feel a little grossed out because it so quickly becomes a gossip tale or entertainment.”</p>\n<p>Walking along Red River Street a couple of days later, Wilken was startled to see nothing out of the ordinary. “Where I saw people lying there dead or hurt, now there were people walking and drinking and partying as if nothing had happened,” she said. “It was creepy just seeing how quickly things went back to normal.”</p>\n"}]